{
  "title": "Component Steps",
  "headers": [
    "Component Steps",
    "Contents:",
    "Introduction",
    "Using components",
    "Parameters",
    "Usage scenarios",
    "Path variables in components"
  ],
  "content": "Components are plan files that can be used as reusable modules that behave like steps inside other plan files. They can contain any combination of steps and even other components.\n\nComponents are constructed similarly to plan files, except that they must begin and end with Integration Input and Integration Output steps, respectively. To use them inside a plan file, drag the Component (.comp file) onto a plan file and connect it to other steps in the workflow.\n\nConnect the columns specified in the Component to columns in the plan file by double-clicking the Component step and entering the appropriate columns in the Columns node of the Component step properties.\n\nIt is also possible to make properties of steps inside the Component file available to the containing plan file. Right-clicking on any property label inside a step in a Component file will present an option to “Map as Parameter”. Selecting this action will add the property to the Component step in the containing plan file under the “Parameters” node. Properties that have been mapped will be indicated in by an icon next to the property label in the step configuration. A list of all mapped parameters can also be viewed in the “Mappings” tab of the Properties panel of the Component file being edited.\n\nThere are a few different scenarios for Component steps.Single input and output with only filter steps between. In this case, the data structure and format that comes out of the Component step is the same as what goes in. The data itself may be modified, but no structural changes are made and no columns are added or removed. This is the simplest case to configure.Adding a column inside the Component. In this case, one or more columns have been added inside the Component and must be mapped to existing columns in the containing plan file. This is done using the Component step properties.Modifying the format inside the Component. Most steps preserve the format of incoming data; however some, such as Union, alter the data format and must be accounted for in the containing plan file.\n\nWhen referring to external files inside a Component (e.g., lookup files), it is good practice to use path variables to specify their locations. In this case, if the Component file and plan file are in different directories, the external files will still be available to the containing plan file.\n\nIn order to do this, you must first specify an ID for the Component. In the Properties panel of the Plan editor there are additional property tabs specific to Components when a Component file is being edited. There is one labeled “Id”. Enter a name for the Component here. Then, to reference an external file, use the following format: pathvar://[component name]_dir/[file name]. For example, if the component is called “myComponent”, a file called “filename.txt” would be referenced as “pathvar://myComponent_dir/filename.txt”."
}