{
  "title": "Installation and system requirements",
  "headers": [
    "Installation and system requirements",
    "Contents:",
    "System Requirements",
    "Installation",
    "Installing database connectivity drivers",
    "License Key"
  ],
  "content": "Describes how to make sure [branding:product.name.abbreviation] runs correctly on your machine\n\n[branding:product.name.abbreviation] consists of two major components: the server engine and the graphical\n\tuser interface. Each component has a different set of system requirements.\n\nThe code of the server engine is platform-independent. Therefore, it can be run\n\t\ton almost any platform (combination of operating system and processor architecture), \n\t\tas long as there is a suitable Java Runtime Environment for that platform.\n\t\tThe server engine requires JRE 1.6 or better.\n\nAside from the JRE requirement, [branding:product.name.abbreviation] requires a sufficient amount\n\t\tof memory (at least 256 MB, large configurations may require up to 1 GB;\n\t\tadditional memory may improve performance of the engine.) and enough disk space for \n\t\ttemporary files (2-3 times the amount of the input data is recommended) and data.\n\nThe [branding:product.name.abbreviation] GUI is currently available only for MS Windows. It comes with\n\t\ta bundled JRE 8, so no additional pre-installed packages are required. For optimum \n\t\tperformance, a 2 GHz Intel® Pentium®-class processor (or equivalent) with\n\t\t1GB of memory and a screen resolution of at least 1024x768 is recommended. The installed product requires about \n\t\t600 MB of disk space. It is capable of running in both, 32- and 64-bit environments.\n\nThe following table summarizes the requirements.\n\nFor most platforms, multiple JREs from different vendors are available. Unfortunately,\n\t\tnot all JREs are stable enough to allow processing of large amounts of data. As a \n\t\tproven best practice, it is recommended to use theSun JREon Windows and Linux/Unix systems running Intel-compatible processors. Moreover, most \n\t\tvendors\tof commercial Unix distributions provide stable enough JREs for their platforms.\n\t\tIf available, a commercial JRE with support and regular updates is recommended for \n\t\tproduction deployments.\n\n[branding:product.name.abbreviation] is distributed in two bundles:\n\nInstallation of the product consists of extracting the files to the chosen location\n\t\t(e.g.,c:\\\\[branding:product.name.abbreviation]on Windows/opt/[branding:product.name.abbreviation]on Unix/Linux) and copying of the license file \n\t\t(see below) to the user home folder (this folder is usuallyc:\\\\Documents and Settings\\\\<user name>orc:\\\\Users\\\\<user name>on Windows \n\t\tand/home/<user_name>in Unix/Linux) or to theruntime/license_keyssub-folder\n\t\tof the core installation.\n\t\tWhen installing the GUI, it is recommended to place a shortcut to \n\t\tthe launcher (i.e. [branding:product.executable.abbreviation].exe) in a Start menu folder or on the desktop for easy access.\n\t\tNote that installing [branding:product.name.abbreviation] on Windows does not change the system registry.\n\n[branding:product.name.abbreviation] uses the Java Database Connectivity (JDBC) API for connecting to \n\tdatabases. JDBC drivers are available for most database engines and are distributed \n\tas a component of the database engine or separately as connectivity components.\n\tThe licensing terms do not always allow distribution of these drivers\n\twith [branding:product.name.abbreviation]. Therefore, [branding:product.name.abbreviation] ships with only a basic\n\tset of drivers for the most common databases and additional drivers may be installed by the\n\tuser.\n\nThe following drivers shipped with [branding:product.name.abbreviation] are located in thelib/jdbcsub-folder of the [branding:product.name.abbreviation] core installation.\n\nEach driver (including those shipped with the product) has to be installed before it can \n\tbe used. A driver can be installed to the core by copying its.jarfile to thelibsub-folder of the core installation, and using the dialogWindow → Preferences → [branding:vendor.product.name] → DB Driversin the GUI.\n\nBy purchasing [branding:product.name.abbreviation], you obtain the license key (a file with a.plfextension).\nWhen [branding:product.name.abbreviation] core starts, it looks for this file first in thelicense_keysdirectory\nin the installation folder and then in the home folder of the current user.\n\nEach license file may contain several restrictions, such as the operating system,  \n[branding:product.name.abbreviation] version, date validity range, etc. A license file is considered valid only\nif all of its conditions for use are met.\nIf no matching license key is found, [branding:product.name.abbreviation] exits with an error.\nAdditionally, a license file may contain a restriction of the functionality granted by\nthe license file. Functionality not covered by the license is reported as an error by both the \nGUI and core."
}