{
  "title": "Performance runtime options",
  "headers": [
    "Performance runtime options",
    "Contents:",
    "Introduction",
    "Concept",
    "File runtime.properties",
    "Performance settings file format",
    "Numeric values",
    "Errors and debugging"
  ],
  "content": "Each plan contains some steps and these steps can have properties affecting performance or generally\nbehavior of the steps which can be set up using a file (performance settings file) which has the same name as used plan file plus \".perf\" suffix.\n\nProperties have single name and type. Type can be one of:stringintegerlong.And there is one special property which determines number of threads used for running filter steps.\n\nEach step can use different properties and of course many properties are shared among the steps. But it is\noften desirable to use different values for different instances of steps. And therefore the performance\nsettings file allows to define rules which contain properties and can be applied only to selected steps. If \nmore rules can be applied to a step then the last rule in the file is applied first. If first chosen rule doesn't\ncontain property then another rule is tried to apply. In some more complicated steps there could be desirable to\nhave different values for one property. And therefore properties can have named sub-properties.\n\nBefore introducing the performance settings file there was a different way how to set runtime properties. The\nproperties can be in \"runtime.properties\" file in java properties format. This way only allowed to set each property\nvalue for all step instances at once. This file is still used as default values if no value is found in the performance\nsettings file.\n\nThe first element contains default rule and then specific rules are listed.\n\nThe parallelism level for filter step\ninstances can expressed either as fixed number of threads or as relative float number. For relative number the number\nof threads are computed as number of cpus multiplied by relative number.\n\nEach rule except the default must have either id step matcher or class step matcher or both. The matcher contains\nregular expression."
}