{
  "title": "Step Referential Join",
  "headers": [
    "Contents:",
    "Step Referential Join",
    "Properties",
    "Endpoints",
    "Detailed Description",
    "Element Key Column Mapping",
    "Properties",
    "Element Match Key",
    "Properties",
    "Element Matching Measure",
    "Properties",
    "Element Order By",
    "Properties",
    "Element Ref Match Rule",
    "Properties",
    "Element Ref Output Column",
    "Properties",
    "Abstract element Ref Source Config",
    "Implementations",
    "Element Db Ref Source",
    "Properties",
    "Element File Ref Source",
    "Properties",
    "Element Flow Ref Source",
    "Properties",
    "Element Source Key",
    "Properties",
    "Element Union Key Component",
    "Properties",
    "Element Lookup Ref Source",
    "Properties"
  ],
  "content": "The reference source contains records indexed by several keys. The definition of keys (name, components, condition)\n\t\t\tis stored in source metadata.\n\t\t\tThis step uses key definition for generating values searched in index. Each key value is calculated\n\t\t\texactly as specified in metadata using mapping from input columns to columns used in key components.\n\nEach input records and its search keys can fetch several records from reference source. All records having at least one\n\t\t\tkey from set are fetched. These records are accessed through dot-source namedrefin configured expressions.\n\t\t\tFetching reference records can be limited by specifying maximal number of appropriate records found by each key.For example\n\t\t\tfor searching based on personal name it would be accepted max. 50 records to eliminate huge (and actually unusable)\n\t\t\tload caused by too common names as \"John\".\n\nEach pair of the input record and fetched reference record is then tested using specified matching rules. Records satisfying\n\t\t\tat least one rule are accepted for output. Again, maximal number of output records for one input can be specified and only\n\t\t\tthe best records (based on selection criterion) are accepted.\n\nFetched, matched and selected reference records form output group of records calculated by output expressions.\n\t\t\tThe expressions can use input record, reference record or some metadata values accessed byresultdot-source\n\t\t\tand can aggregate values in group.\n\nThere are two special dot-sources used in expressions:queryApplicable in matching and selection rules, i.e. during selection from all fetched records. \n\t\t\t\t\t\t\tContains columns:pk- reference record's primary keyruleName- name of satisfied matching rulecount- number of all fetched reference recordsresultApplicable in final generating of output records, in outputColumn expression.\n\t\t\t\t\t\t\tContains columns:pk- reference record's primary keyruleName- name of satisfied matching rulecount- number of matched reference recordsorder- record's order in matched grouprecordDescriptor- record descriptor\n\nExample:The measure of namemm_name, defined by expressioneditDistance(pivot.name, candidate.name)is used in some rule's expressionmeasures.mm_name < 3 and pivot.city == candidate.city,and in other rule's expressionmeasures.mm_name < 2 and editDistance(pivot.city, candidate.city) < 2.The use of matching measures is identical in Matching and Unification step."
}