{
  "title": "Step Statistics",
  "headers": [
    "Contents:",
    "Step Statistics",
    "Properties",
    "Endpoints",
    "Detailed Description",
    "Example",
    "Element Statistic",
    "Properties",
    "Element Column Statistic",
    "Properties",
    "Enum Column Statistic Type",
    "Values"
  ],
  "content": "This step is capable of multiple analytical operations\n\t\t\t\t\tin a single pass over multiple columns of input data.\n\t\t\t\t\tAll data types supported by [branding:product.name.abbreviation] can be used as long as they correspond\n\t\t\t\t\tto the applied data operations.Analytical OperationFLOAT, INTEGER, LONGDAY, DATETIMEBOOLEANSTRINGRecord CountyesyesyesyesNull CountyesyesyesyesNot Null CountyesyesyesyesDistinct Value CountyesyesyesyesUnique Value CountyesyesyesyesSumyes-yes-Averageyesyesyes-MedianyesyesyesyesStandard Deviationyesyes--Varianceyesyes--Fist X valuesyesyesyesyesLast X valuesyesyesyesyesMinimum length of sequence---yesMinimum length of non-empty sequence---yesAverage length of sequence---yesMedian length of sequence---yesMaximum length of sequence---yesQuantile ValueyesyesyesyesApproximate Quantile Valueyesyes--\n\nStep outputs:out_stat- statistical output : \n\t\t\t\t\t\t\tcontains results of statistical operations. Its format is as follows:stat_name [STRING] - user defined name for the statistic\n\t\t\t\t\t\t\t\t\t(seeColumn Statistics Name)stat_result [STRING] - value of the statisticstat_distinction [STRING] - distinction number of the statistic's record \n\t\t\t\t\t\t\t\t\t(among all the records belonging to the same statistic). Forms a row 0,1,2...out_rec- data output. It has the same format as\n\t\t\t\t\t\t\tinput data flow \n\t\t\t\t\t\t\tData Output - has the same format as Data and for both\n\t\t\t\t\t\t\trequired fields in input and output sections they are\n\t\t\t\t\t\t\treferenced with the identifierout_rec.\n\nFor each statistic computed by [branding:product.name.abbreviation] a single row is returned, as long as\n\t\t\t\t\tthe statistic does not have the parametercount, or an input supplied by the parametercount."
}