{
  "title": "Step Unification",
  "headers": [
    "Contents:",
    "Step Unification",
    "Properties",
    "Endpoints",
    "Detailed Description",
    "Element Column Ref",
    "Properties",
    "Element Group Id Strategy",
    "Properties",
    "Abstract element Grouping Method",
    "Properties",
    "Implementations",
    "Element Classic Hierarchical",
    "Properties",
    "Element Matching Rule",
    "Properties",
    "Element Test",
    "Properties",
    "Detailed Description",
    "Element Order By",
    "Properties",
    "Element Hierarchical",
    "Properties",
    "Element Cond Key",
    "Properties",
    "Element Key Component",
    "Properties",
    "Element Hierarchical Union",
    "Properties",
    "Element Union Key",
    "Properties",
    "Element Union Key Component",
    "Properties",
    "Element Simple Key",
    "Properties",
    "Element Union",
    "Properties",
    "Element Matching Measure",
    "Properties",
    "Element Repository Properties",
    "Properties",
    "Element Unify Attributes",
    "Properties"
  ],
  "content": "Threshold for weighted sum of all tests. If this threshold is exceeded (is greater than this value), records are declared not similar (and the test fails).\n\nExample:The measure of namemm_name, defined by expressioneditDistance(pivot.name, candidate.name)is used in some rule's expressionmeasures.mm_name < 3 and pivot.city == candidate.city,and in other rule's expressionmeasures.mm_name < 2 and editDistance(pivot.city, candidate.city) < 2.The use of matching measures is identical in Matching and Unification step.\n\nThis property specifies whether the file repository should be updated directly, bypassing the transaction log and leading to high performance and shorter transaction times.\n\t\t\t\tThe downside of updating the repository directly is that repository consistency cannot be guaranteed in case of software and/or hardware failure.\n\t\t\t\tFor database repository, this specifies whether updates will be divided into more smaller transaction instead one big transaction. \n\t\t\t\tThis operation mode is recommended only for full loads, a repository initialization with a large number of records.\n\t\t\t\tIn case theSave Logsproperty is set to true, a transaction log is created and can be used for mirroring, however rollback ability\n\t\t\t\tis still lost.\n\nIndicates that access to the repository will not be hindered by runtime synchronization in a parallel updates scenario. This mode is useful only with theRead Onlyproperty.\n\nDirectory that contains the transaction log. Can be used for mirroring ifreadOnly=trueand the logFolder points to the source repository\n\t\t\t\tdirectory.\n\nThis property specifies that logs are saved even after the end of the transaction. Can be used for mirroring of this repository."
}